In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:86% !important;}
div.cell.code_cell.rendered{width:100%;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.output {font-size:10pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:130px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:15px;}
</style>
"""))

<font size = "5" color = 'red' > ch11 데이터프레임과 시리즈(pandas) </font>
- pip install pandas / conda install pandas (프롬프트)

# 1절 판다스 패키지
- 데이터 분석을 위해 반드시 알아야 할 패키지. 넘파이numpy 기반으로 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임(excel의 스프레드시트)을 제공
- 판다스 장점 : 파일io, 부분 데이터 추출, 크기 변경, 데이터 분할, 병합, 정렬, 결측치 처리, 피벗과 언피벗(와이드포멧과 롱포멧) 등에 용이
- [Pandas API reference](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas docs](https://pandas.pydata.org/docs/index.html)

In [3]:
import pandas as pd
pd.__version__

'1.5.3'

In [90]:
data = pd.read_csv('data/ch09_member4.csv')
display(data)
display(type(data))

   name  age    email  address
0   홍길동   22  a@a.com      신림동
1   신길동   32  b@b.com      신갈동
2   홍길숙   42  c@c.com      신원동
3   홍길동   22  a@a.com      신림동
4   신길동   32  b@b.com      신갈동
5   홍길숙   42  c@c.com      신원동
6  name  age    email  address
7   홍길동   22  a@a.com      신림동
8   신길동   32  b@b.com      신갈동
9   홍길숙   42  c@c.com      신원동

pandas.core.frame.DataFrame

In [22]:
data = pd.read_csv('data/ch09_member1.csv', 
                  names = ['name','age','email','address']) # header = None => 헤더가 없는 데이터프레임 생성
display(data)
display(type(data))

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구
2  신길동   30  sindong@hong.com   서울시 동작구

pandas.core.frame.DataFrame

In [23]:
# 최초 상위 2줄
data.head(2)

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구

In [25]:
data = pd.read_json('data/ch09_member.json') # 기본 인코딩 값 utf-8
data

  name  age             email address
0  홍길동   20  kildong@hong.com      서울
1  신길동   30  shinkil@hong.com      인천

In [29]:
iris = pd.read_hdf('data/ch09_iris.hdf5', key = 'iris')
iris.head() # 상위 5개 추출

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# 2절 데이터프레임 만들기
## 2.1 딕셔너리를 이용해서 데이터프레임 만들기

In [33]:
d = {'kor' : [100, 90], 'math' : [95, 99]} # 딕셔너리를 데이터프레임으로
df = pd.DataFrame(d)
df

   kor  math
0  100    95
1   90    99

In [35]:
df.to_dict() # 데이터프레임을 딕셔너리로 변환

{'kor': {0: 100, 1: 90}, 'math': {0: 95, 1: 99}}

In [37]:
df.to_numpy()

array([[100,  95],
       [ 90,  99]], dtype=int64)

In [44]:
# 딕셔너리 리스트를 데이터 프레임으로
d = [{'kor' : 100, 'math' : 95},{'kor' : 90, 'math' : 99}] # 딕셔너리 리스트 : 웹크롤링 등의 경우 자주 활용
pd.DataFrame(d)

   kor  math
0  100    95
1   90    99

In [50]:
kor = [100,90] ; math = [95,99]
pd.DataFrame(zip(kor,math), columns = ['kor', 'math'])

   kor  math
0  100    95
1   90    99

In [51]:
df.info() # ★

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      int64
 1   math    2 non-null      int64
dtypes: int64(2)
memory usage: 160.0 bytes

In [61]:
d = [{'kor' : 100, 'math' : 100}, {'kor' : 90, 'math' : 91}, {'kor' : 93, 'eng': 100}]
df = pd.DataFrame(d)
df

   kor   math    eng
0  100  100.0    NaN
1   90   91.0    NaN
2   93    NaN  100.0

In [62]:
df.info() # 결측치는 실수형(float64), 정수형 변환이 불가 => 결측치 대체 후 정수형 변환

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   math    2 non-null      float64
 2   eng     1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [63]:
d = [{'kor' : 100, 'math' : 100}, {'kor' : 90, 'math' : 91}, {'kor' : 93, 'eng': 100}]
df = pd.DataFrame(d)
df

   kor   math    eng
0  100  100.0    NaN
1   90   91.0    NaN
2   93    NaN  100.0

## 2.2 리스트를 이용해서 데이터프레임 만들기

In [66]:
title = ['책1','책2','책3']
price = [15000,18000,10000]
df = pd.DataFrame(data={'title':title, 'price':price})
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [69]:
import numpy as np
np.c_[title, price]
df = pd.DataFrame(np.c_[title, price], columns=['title','price'])
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [82]:
df = pd.DataFrame(np.c_[title,price], columns=['title','price'])
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [81]:
l = [['책1',15000],['책2',18000],['책3',10000],]
l
pd.DataFrame(l, columns=['title','price'])

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

## 2.3 pd.read_csv

In [110]:
df = pd.read_csv(r'C:\ai_x\download\sharedata\상가정보_20250331\소상공인시장진흥공단_상가(상권)정보_세종_202503.csv',
                 # encoding='utf-8',
                 # sep=',',
                low_memory = False, # 데이터용량이 클 경우만 기입,
                nrows = 30, # 처음 30행만
                )
df.shape
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [111]:
# 판다스 디스플레이 옵션 : 
pd.options.display.max_columns = 39 # 기본값 20 => 39열까지 display 가능
pd.options.display.max_rows # 기본값 60 => 설정값에 따라 display 기능 설정 가능
display(df.head(1))

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [108]:
display(df.head(1).T)

                                   0
상가업소번호          MA010120220700019175
상호명                       세종수이비인후과의원
지점명                              NaN
상권업종대분류코드                         Q1
상권업종대분류명                        보건의료
상권업종중분류코드                       Q102
상권업종중분류명                          의원
상권업종소분류코드                     Q10201
상권업종소분류명                   내과/소아과 의원
표준산업분류코드                      Q86201
표준산업분류명                         일반의원
시도코드                              36
시도명                          세종특별자치시
시군구코드                          36110
시군구명                         세종특별자치시
행정동코드                       36110525
행정동명                             해밀동
법정동코드                     3611011600
법정동명                             해밀동
지번코드             3611011600200050002
대지구분코드                             2
대지구분명                              산
지번본번지                              5
지번부번지                            2.0
지번주소        세종특별자치시 세종특별자치시 해밀동 산5-2
도로명코드                   361103352828
도로명             세종특별자치시 세종특별자치시 해밀3로
건물본번지                             43
건물부번지                            NaN
건물관리번호     3611011600200050002000001
건물명                         행정중심복합도시
도로명주소        세종특별자치시 세종특별자치시 해밀3로 43
구우편번호                            NaN
신우편번호                          30092
동정보                              NaN
층정보                              NaN
호정보                              NaN
경도                        127.264487
위도                         36.528585

In [119]:
df = pd.read_csv('data/ch11_membersep.csv', sep = '|')
df

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01

In [137]:
# (1) csv파일 불러오기(기본값)
# encoding = utf-8, sep = ',', csv파일의 첫번째 줄을 header로 인식, #이 있는 줄도 데이터로 인식
member = pd.read_csv('data/ch11_member.csv')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [138]:
# type형 변환 Age열 : int64 => int16
member['Age'] = member['Age'].astype(np.int16) # 'int' = > int32, 'float' => float64
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int16
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int16(1), object(4)
memory usage: 332.0+ bytes

In [152]:
# 형 변환 : Birth열 object => datetime64[ns]
# member['Birth']
member['Birth_as'] = member['Birth'].astype('datetime64[ns]')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      int64
 2   Email     5 non-null      object
 3   Address   5 non-null      object
 4   Birth     5 non-null      object
 5   Birth_as  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 368.0+ bytes

In [153]:
member['Birth_to'] = pd.to_datetime(member['Birth']) # astype()함수보다 안전한 형변환
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      int64
 2   Email     5 non-null      object
 3   Address   5 non-null      object
 4   Birth     5 non-null      object
 5   Birth_as  5 non-null      datetime64[ns]
 6   Birth_to  5 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 408.0+ bytes

In [154]:
# (2) 특정 행 제외하고 csv파일 읽기
member = pd.read_csv('data/ch11_membercp949.csv',encoding='cp949',
                    skiprows=[],
                    comment = '#') # 1번째 6번째 행은 제외하고 읽어오기 (헤더 = 인덱스 0번쨰)
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

In [161]:
# (3) 주석(#) 제외,datetime형 필드 지정하여 csv 읽기
member = pd.read_csv('data/ch11_membertab.csv',
                     sep = '\t',
                     comment='#',
                    parse_dates=['Birth']) # ['Birth']를 가능하다면 datetime64[ns]형(type)으로 인식해라
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes

In [163]:
# (4) sep ='|', 상위 5행만 읽어오기
member = pd.read_csv('data/ch11_membersep.csv', sep='|',nrows=5, ) # nrows = n : 상위 n개를 가져와라
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 2.4 패키지에서 가져오기(iris 데이터)
- sklearn, statsmodel, seaborn

### ★ iris 가져오기 방법 1 : sklearn (머신러닝 패키지)
- 컬럼 체크
- 독립변수, 종속변수의 데이터 형태를 조정
- 데이터프레임화

In [207]:
import numpy as np
import pandas as pd
from sklearn import datasets 
# sklearn : 머신러닝을 위한 함수(전처리함수, 머신러닝, 성능평가를 위한 함수, 학습데이터셋)

In [208]:
iris = datasets.load_iris()
iris.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [209]:
print(iris.DESCR) # iris데이터 셋에 대한 설명

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...

In [210]:
iris.data # 독립변수
iris['data'][:3]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [211]:
# 데이터프레임에서 열이름
iris['feature_names']
columns = [i[:-5].replace(' ','_') for i in iris['feature_names']] + ['species']

In [212]:
columns

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [213]:
iris.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [214]:
iris.target # 머신러닝 시 종속변수

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [217]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [218]:
species = iris.target_names[iris.target] # numpy 배열인덱싱

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [223]:
# 컬럼은 이미 완성되었으니 사용할 데이터를 합쳐서 완성시키기
# 독립변수
data = iris.data
# 종속변수
target = iris.target_names[iris.target]
data.shape, target.shape # 독립변수와 종속변수의 차원
final_data = np.c_[data,target]
iris_df = pd.DataFrame(final_data,columns=columns)
iris_df

    sepal_length sepal_width petal_length petal_width    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

### iris 가져오기 방법 2 : statsmodels (R 데이터) => 인터넷에 연결되야 활용 가능

### iris 가져오기 방법 3 : seaborn (시각화 패키지)